-- I was asked to modify some SQL to include Extended Event information.
-- The origin of the rest of this SQL is only known to be from a Splunk TA
-- Where it came from prior to that is not known to me
-- I only added the [EPExtendedEvent] view fields and join
SELECT
        [EPOEvents].[ReceivedUTC] as [timestamp],
        [EPOEvents].[AutoID],
        [EPOEvents].[ThreatName] as [signature],
        [EPOEvents].[ThreatType] as [threat_type],
        [EPOEvents].[ThreatEventID] as [signature_id],
        [EPOEvents].[ThreatCategory] as [category],
        [EPOEvents].[ThreatSeverity] as [severity_id],
        [EPOEventFilterDesc].[Name] as [event_description],
        [EPOEvents].[DetectedUTC] as [detected_timestamp],
        [EPOEvents].[TargetFileName] as [file_name],
        [EPOEvents].[AnalyzerDetectionMethod] as [detection_method],
        [EPOEvents].[ThreatActionTaken] as [vendor_action],
        CAST([EPOEvents].[ThreatHandled] as int) as [threat_handled],
        [EPOEvents].[TargetUserName] as [logon_user],
        [EPOComputerProperties].[UserName] as [user],
        [EPOComputerProperties].[DomainName] as [dest_nt_domain],
        [EPOEvents].[TargetHostName] as [dest_dns],
        [EPOEvents].[TargetHostName] as [dest_nt_host],
        [EPOComputerProperties].[IPHostName] as [fqdn],
        [dest_ip] = ( convert(varchar(3),convert(tinyint,substring(convert(varbinary(4),convert(bigint,([EPOComputerProperties].[IPV4x] + 2147483648))),1,1)))+'.'+convert(varchar(3),convert(tinyint,substring(convert(varbinary(4),convert(bigint,([EPOComputerProperties].[IPV4x] + 2147483648))),2,1)))+'.'+convert(varchar(3),convert(tinyint,substring(convert(varbinary(4),convert(bigint,([EPOComputerProperties].[IPV4x] + 2147483648))),3,1)))+'.'+convert(varchar(3),convert(tinyint,substring(convert(varbinary(4),convert(bigint,([EPOComputerProperties].[IPV4x] + 2147483648))),4,1))) ),
        [EPOComputerProperties].[SubnetMask] as [dest_netmask],
        [EPOComputerProperties].[NetAddress] as [dest_mac],
        [EPOComputerProperties].[OSType] as [os],
        [EPOComputerProperties].[OSVersion] as [os_version],
        [EPOComputerProperties].[OSBuildNum] as [os_build],
        [EPOComputerProperties].[TimeZone] as [timezone],
        [EPOEvents].[SourceHostName] as [src_dns],
        [src_ip] = ( convert(varchar(3),convert(tinyint,substring(convert(varbinary(4),convert(bigint,([EPOEvents].[SourceIPV4] + 2147483648))),1,1)))+'.'+convert(varchar(3),convert(tinyint,substring(convert(varbinary(4),convert(bigint,([EPOEvents].[SourceIPV4] + 2147483648))),2,1)))+'.'+convert(varchar(3),convert(tinyint,substring(convert(varbinary(4),convert(bigint,([EPOEvents].[SourceIPV4] + 2147483648))),3,1)))+'.'+convert(varchar(3),convert(tinyint,substring(convert(varbinary(4),convert(bigint,([EPOEvents].[SourceIPV4] + 2147483648))),4,1))) ),
        [EPOEvents].[SourceMAC] as [src_mac],
        [EPOEvents].[SourceProcessName] as [process],
        [EPOEvents].[SourceURL] as [url],
        [EPOEvents].[SourceUserName] as [source_logon_user],
        [EPOComputerProperties].[IsPortable] as [is_laptop],
        [EPOEvents].[AnalyzerName] as [product],
        [EPOEvents].[AnalyzerVersion] as [product_version],
        [EPOEvents].[AnalyzerEngineVersion] as [engine_version],
        [EPOEvents].[AnalyzerDATVersion] as [dat_version],
        [EPOProdPropsView_VIRUSCAN].[datver] as [vse_dat_version],
        [EPOProdPropsView_VIRUSCAN].[enginever64] as [vse_engine64_version],
        [EPOProdPropsView_VIRUSCAN].[enginever] as [vse_engine_version],
        [EPOProdPropsView_VIRUSCAN].[hotfix] as [vse_hotfix],
        [EPOProdPropsView_VIRUSCAN].[productversion] as [vse_product_version],
        [EPOProdPropsView_VIRUSCAN].[servicepack] as [vse_sp],
        [EPExtendedEvent].[SourceHash],
        [EPExtendedEvent].[SourceProcessHash],
        [EPExtendedEvent].[SourceProcessSigned],
        [EPExtendedEvent].[TargetHash],
        [EPExtendedEvent].[TargetSigned],
        [EPExtendedEvent].[TargetSigner],
        [EPExtendedEvent].[BladeName],
        [EPExtendedEvent].[AnalyzerContentCreationDate],
        [EPExtendedEvent].[AnalyzerContentVersion],
        [EPExtendedEvent].[AnalyzerRuleID],
        [EPExtendedEvent].[AnalyzerRuleName],
        [EPExtendedEvent].[FirstActionStatus],
        [EPExtendedEvent].[SecondActionStatus],
        [EPExtendedEvent].[AttackVectorType]
FROM [EPOEvents]
LEFT JOIN [EPOLeafNode] ON [EPOEvents].[AgentGUID] = [EPOLeafNode].[AgentGUID]
LEFT JOIN [EPOProdPropsView_VIRUSCAN] ON [EPOLeafNode].[AutoID] = [EPOProdPropsView_VIRUSCAN].[LeafNodeID]
LEFT JOIN [EPOComputerProperties] ON [EPOLeafNode].[AutoID] = [EPOComputerProperties].[ParentID]
LEFT JOIN [EPExtendedEvent] ON [EPOEvents].[AutoID] = [EPExtendedEvent].[EventAutoID]
LEFT JOIN [EPOEventFilterDesc] ON [EPOEvents].[ThreatEventID] = [EPOEventFilterDesc].[EventId]
AND ([EPOEventFilterDesc].[Language]='0409')